#pragma once
class TetrisInfo
{
#define BLOCK_COUNT 7

public:
	static bool block[BLOCK_COUNT][4][4];
};

bool TetrisInfo::block[BLOCK_COUNT][4][4] = {
	{
		// бсбс
		// бсбс
		{0,0,0,0},
		{0,1,1,0},
		{0,1,1,0},
		{0,0,0,0},
	},
	{
		// бсбсбс
		// бс
		{0,0,0,0},
		{0,1,1,1},
		{0,1,0,0},
		{0,0,0,0},
	},
	{
		// бсбсбс
		//   бс
		{0,0,0,0},
		{1,1,1,0},
		{0,0,1,0},
		{0,0,0,0},
	},
	{
		// бсбсбс
		//  бс
		{0,0,0,0},
		{0,1,0,0},
		{0,1,1,0},
		{0,1,0,0},
	},
	{
		// бсбс
		//  бсбс
		{0,0,0,0},
		{0,1,1,0},
		{0,0,1,1},
		{0,0,0,0},
	},
	{
		//  бсбс
		// бсбс
		{0,0,0,0},
		{0,1,1,0},
		{1,1,0,0},
		{0,0,0,0},
	},
	{
		// бсбсбсбс
		{0,1,0,0},
		{0,1,0,0},
		{0,1,0,0},
		{0,1,0,0},
	},
};
